hw2/rails-intro/app/controllers/movies_controller.rb

  def index
    redirect = false

    @sort = params[:sort] ? params[:sort] : session[:sort]
    @ratings = params[:ratings] ? params[:ratings] : session[:ratings]

    if (params[:sort] != @sort) || (params[:ratings] != @ratings)
      redirect = true
    end

    @all_ratings = Movie.pluck(:rating).uniq

    if @ratings.nil?
      @ratings = {}
      @all_ratings.each{ |i| @ratings[i] = "on" }
---
SELECT "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies" WHERE "rating"."G" = '1' AND "rating"."R" = '1' ORDER BY release_date