hw4/bdd-tdd-cycle/rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = 1 LIMIT 1
SELECT "movies".* FROM "movies" WHERE "director"."director" = 'Asd' LIMIT 1
---
  def with_the_same_director
    movie = Movie.find_by_id(params[:id])
    if movie.director.nil? || movie.director.empty?